hassan98ashrf/embedded_system_online_diploma/unit7_MCU_peripherals/STM32/GPIO_add/stm32_f103c6_driver/inc/stm32_f103c6_driver_GPIO.h
/*
 * stm32_f103c6_driver_GPIO.h
 *
 *  Created on: Jun 1, 2023
 *      Author: hassa
 */

#ifndef INC_STM32_F103C6_DRIVER_GPIO_H_
#define INC_STM32_F103C6_DRIVER_GPIO_H_

//-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*
//INCLUDES
//-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*
#include "stm32_f103c6.h"

//==================================================================================

//-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*
//Configuration structure
//-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*
typedef struct{
	uint16_t GPIO_PinNumber	  ; 	//Specifies the GPIO pin to be configured
									// this parameter must be set based on @ref GPIO_PINS_define
	uint8_t  GPIO_MODE    	  ;		//Specifies the operating mode for selected pin
									// this parameter must be set based on @ref GPIO_MODE_define
	uint8_t  GPIO_OutPut_Speed;     //Specifies the speed for selected pin
									// this parameter must be set based on @ref GPIO_SPEED_define
}GPIO_PinConfig_t;

//==================================================================================

//-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*
//Macros Configuration references
//-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*
//@ref GPIO_PINS_define
#define GPIO_PIN_0					((uint16_t)0x0001)	//selected PIN 0
#define GPIO_PIN_1					((uint16_t)0x0002)	//selected PIN 1
#define GPIO_PIN_2					((uint16_t)0x0004)	//selected PIN 2
#define GPIO_PIN_3					((uint16_t)0x0008)	//selected PIN 3
#define GPIO_PIN_4					((uint16_t)0x0010)	//selected PIN 4
#define GPIO_PIN_5					((uint16_t)0x0020)	//selected PIN 5
#define GPIO_PIN_6					((uint16_t)0x0040)	//selected PIN 6
#define GPIO_PIN_7					((uint16_t)0x0080)	//selected PIN 7
#define GPIO_PIN_8					((uint16_t)0x0100)	//selected PIN 8
#define GPIO_PIN_9					((uint16_t)0x0200)	//selected PIN 9
#define GPIO_PIN_10					((uint16_t)0x0400)	//selected PIN 10
#define GPIO_PIN_11					((uint16_t)0x0800)	//selected PIN 11
#define GPIO_PIN_12					((uint16_t)0x1000)	//selected PIN 12
#define GPIO_PIN_13					((uint16_t)0x2000)	//selected PIN 13
#define GPIO_PIN_14					((uint16_t)0x4000)	//selected PIN 14
#define GPIO_PIN_15					((uint16_t)0x8000)	//selected PIN 15
#define GPIO_PIN_All				((uint16_t)0xFFFF)	//selected All PIN
#define GPIO_PIN_MASK				0x0000FFFFu			//pin mask for assert test

//@ref GPIO_MODE_define
#define GPIO_MODE_Analog			0x00000000u			//Analog mode
#define GPIO_MODE_InPut_Flo			0x00000001u			//Floating input
#define GPIO_MODE_InPut_PU			0x00000002u			//Input with pull-up
#define GPIO_MODE_InPut_PD			0x00000003u			//Input with pull down
#define GPIO_MODE_OutPut_PP			0x00000004u			//General purpose output push-pull
#define GPIO_MODE_OutPut_OD			0x00000005u			//General purpose output Open-drain
#define GPIO_MODE_OutPut_AF_PP		0x00000006u			//Alternate function output Push-pull
#define GPIO_MODE_OutPut_AF_OD		0x00000007u			//Alternate function output Open-drain
#define GPIO_MODE_AF_InPut			0x00000008u			//Alternate function input

//@ref GPIO_SPEED_define
#define GPIO_SPEED_10M				0x00000001u			//Output mode, max speed 10 MHz.
#define GPIO_SPEED_2M				0x00000002u			//Output mode, max speed 2 MHz
#define GPIO_SPEED_50M				0x00000003u			//Output mode, max speed 50 MHz


//@ref GPIO_PIN_state
#define GPIO_PIN_set				1
#define GPIO_PIN_reset 				0

//@ref GPIO_RETURN_LOCK
#define GPIO_RETURN_LOCK_Enable				1
#define GPIO_RETURN_LOCK_Error 				0

//==================================================================================

//-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*
//APIs supported by MCAL GPIO driver
//-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*

void MCAL_GPIO_Init(GPIO_TypeDef * GPIOx , GPIO_PinConfig_t * PinConfig);
void MCAL_GPIO_DeInit(GPIO_TypeDef * GPIOx );

uint8_t MCAL_GPIO_ReadPin(GPIO_TypeDef * GPIOx , uint16_t PinNumber);
uint16_t MCAL_GPIO_ReadPort(GPIO_TypeDef * GPIOx );

void MCAL_GPIO_WritePin(GPIO_TypeDef * GPIOx , uint16_t PinNumber,uint8_t value);
void MCAL_GPIO_WritePort(GPIO_TypeDef * GPIOx,uint32_t value );

void MCAL_GPIO_TogglePin(GPIO_TypeDef * GPIOx , uint16_t PinNumber);

uint8_t MCAL_GPIO_LockPin(GPIO_TypeDef * GPIOx , uint16_t PinNumber);



#endif /* INC_STM32_F103C6_DRIVER_GPIO_H_ */
